Model: "ASR_model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, 52)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 50)     39050       input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 50)     200         conv1d[0][0]                     
__________________________________________________________________________________________________
p_re_lu (PReLU)                 (None, None, 50)     50          batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 50)     37550       p_re_lu[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 50)     200         conv1d_1[0][0]                   
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, None, 50)     50          batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 50)     37550       p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 50)     200         conv1d_2[0][0]                   
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, None, 50)     50          batch_normalization_2[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, None, 50)     0           p_re_lu[0][0]                    
                                                                 p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 50)     37550       add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 50)     200         conv1d_3[0][0]                   
__________________________________________________________________________________________________
p_re_lu_3 (PReLU)               (None, None, 50)     50          batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 50)     37550       p_re_lu_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 50)     200         conv1d_4[0][0]                   
__________________________________________________________________________________________________
p_re_lu_4 (PReLU)               (None, None, 50)     50          batch_normalization_4[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 50)     0           add[0][0]                        
                                                                 p_re_lu_4[0][0]                  
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 50)     37550       add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 50)     200         conv1d_5[0][0]                   
__________________________________________________________________________________________________
p_re_lu_5 (PReLU)               (None, None, 50)     50          batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 50)     37550       p_re_lu_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 50)     200         conv1d_6[0][0]                   
__________________________________________________________________________________________________
p_re_lu_6 (PReLU)               (None, None, 50)     50          batch_normalization_6[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 50)     0           add_1[0][0]                      
                                                                 p_re_lu_6[0][0]                  
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 50)     37550       add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 50)     200         conv1d_7[0][0]                   
__________________________________________________________________________________________________
p_re_lu_7 (PReLU)               (None, None, 50)     50          batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 50)     37550       p_re_lu_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 50)     200         conv1d_8[0][0]                   
__________________________________________________________________________________________________
p_re_lu_8 (PReLU)               (None, None, 50)     50          batch_normalization_8[0][0]      
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 50)     0           add_2[0][0]                      
                                                                 p_re_lu_8[0][0]                  
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 50)     37550       add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 50)     200         conv1d_9[0][0]                   
__________________________________________________________________________________________________
p_re_lu_9 (PReLU)               (None, None, 50)     50          batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 50)     37550       p_re_lu_9[0][0]                  
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, 50)     200         conv1d_10[0][0]                  
__________________________________________________________________________________________________
p_re_lu_10 (PReLU)              (None, None, 50)     50          batch_normalization_10[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 50)     0           add_3[0][0]                      
                                                                 p_re_lu_10[0][0]                 
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, None, 340)    300560      add_4[0][0]                      
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, None, 340)    694960      bidirectional[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, None, 340)    115940      bidirectional_1[0][0]            
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, None, 340)    0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, None, 64)     21824       re_lu[0][0]                      
__________________________________________________________________________________________________
tf.nn.softmax (TFOpLambda)      (None, None, 64)     0           dense_1[0][0]                    
==================================================================================================
Total params: 1,550,584
Trainable params: 1,549,484
Non-trainable params: 1,100
__________________________________________________________________________________________________
add Codeadd Markdown